{"meta":{"title":"It is a blog.","subtitle":"这个小盒才是你永远的家","description":"计算机/开发/逆向工程/游戏/英语/数学","author":"G4ng4n","url":"https://G4ng4n.github.io","root":"/"},"pages":[{"title":"关于我 / About Me","date":"2023-12-19T15:56:28.000Z","updated":"2023-12-19T16:01:04.701Z","comments":true,"path":"about/index.html","permalink":"https://g4ng4n.github.io/about/index.html","excerpt":"","text":"经历 C2学校软工专业，本科 毕业在微型企业工作约两年 把公司干倒闭了 本科主要搞的是安全，但在公司期间啥都干 正在备考TOEFL，梦想是留学，妈的英语怎么这么难 技术上的梦想是渲染&#x2F;游戏开发"},{"title":"[404]","date":"2023-12-19T16:07:03.446Z","updated":"2023-12-19T16:07:03.446Z","comments":true,"path":"404.html","permalink":"https://g4ng4n.github.io/404.html","excerpt":"","text":""}],"posts":[{"title":"浅聊桌游规则讲解","slug":"浅聊桌游规则讲解","date":"2024-01-10T10:57:41.000Z","updated":"2024-01-10T13:59:33.838Z","comments":true,"path":"2024/01/10/浅聊桌游规则讲解/","permalink":"https://g4ng4n.github.io/2024/01/10/%E6%B5%85%E8%81%8A%E6%A1%8C%E6%B8%B8%E8%A7%84%E5%88%99%E8%AE%B2%E8%A7%A3/","excerpt":"","text":"前言好久不玩桌游了，最近由于缺乏好的电子游戏而又把目光转向桌游。笔者打算过年前买入一款足够耐玩的桌游，在过年期间召集朋友好好玩几场。因为笔者倾向于游玩高重度的桌游，结合朋友对桌游的爱好程度不同，笔者决定购买一款中到重度之间的桌游（bgg重度3-4左右），而根据笔者对朋友的了解，桌游的教学势必要由笔者亲自进行，提前发布规则书电子档是不会有人看的:|。由此诞生了想要聊一聊桌游规则教学方法的念头。 笔者虽然玩过的桌游不足百款，但规则讲解却有着丰富的实践经验，原因无他，每次约战迟到的一个个朋友都需要笔者重复讲解规则，而笔者在大学期间担任了两年多的技术社团的主要负责职务，在讲解计算机技术上也有一定的经验，因此笔者决定根据自身经验整理出一套合适的桌游规则教学方案。 教学的几个原则笔者将会提出若干个桌游规则讲解原则，原则的说明将会尽量适合绝大多数的桌游规则讲解。由于本文是一种主观的经验的介绍，且是通过笔者在朋友身上的教学经验总结得出，因此读者或多或少难免出现异议，笔者认可这类异议并欢迎讨论。 上面提到的所有的原则都是基于以下几个观点出发： 自己学会某个技能的最好办法就是尝试教会别人。 实践出真知。 类比是最好的理解方式之一。 对于上述出发点，笔者不打算过多说明，笔者认为这些出发点是较为客观、浅显但有效的，因此无需加以解释。 那么进入到原则的说明当中，这些原则不会按照所谓重要程度进行排列，想到哪里就写到哪里。笔者想要提出的原则在下面会按大概的讲解流程书写。在进入正文之前，笔者还是要补充说明，这篇文章不打算涉及毛线类桌游，因为规则过于简单，完全不需要追求讲解的效率与分析对方理解程度，大不了多讲几遍，毛线类的教学很难超过五分钟，因此不需要提前考虑教学问题，当然，如果能应用下列原则也不会犯什么错误就是。 坚持背景代入 对于绝大多数中大盒桌游，无论德式美式，都会有着一个或多或少的背景设定，讲解者最容易忽视这一部分的讲解，一般都是照着规则书大致朗读一遍背景，或是干脆两句话带过，这常常带来不易察觉的后续的讲解困难。笔者认为，背景本身是什么故事并不重要（对于规则教学而言不重要），但仍然要提出背景的原因在于方便玩家的后续理解。这就好像格斗类游戏的出招设定一样，绝大多数的出招按键都是和角色发招的动作相匹配的，这样一来，交代清楚的背景非常有助于加深初学者的记忆。 同样，背景的代入对于游戏配件、游戏目标这些概括性的内容理解非常重要。在TTA教学中，坚持将白点称呼为内政点，所导致的听者理解程度是不同的。背景有助于帮助听者建立规则上的逻辑，从某种程度上说，背景代入到教学中是让玩家从设计师角度解读桌游的规则设计。 而要做好这一点也非常地简单，只需要讲解者记住规则中的名词，坚持使用背景中的词汇，而非“token”、“费用”等词汇。即使游玩时玩家们大多使用这些统一的指代词，教学时也尽量保持着背景氛围的营造。 不要跳过目标&#x2F;对局的结束条件 “目标”是笔者会在背景代入后紧接着讲解的内容，这部分实际上可以算作背景代入的一部分。单独记录出的原因是笔者在视频网站上见到过跳过游戏目标讲解，直接进入流程讲解的视频，这是笔者有意见的地方。游戏的目标作为背景的补充，其被提出时可以帮助玩家快速联想到实现目标所需的途径，进而对玩家理解游戏流程起到一个促进的作用，简单地说，目标的提出能够提升玩家学习流程的积极性，因此从这一关系出发，笔者认为目标的讲解是要在流程之前完成。 永远通过实战讲解流程 每一个讲解过桌游规则的玩家都清楚，流程的讲解才是重中之重，对于流程复杂的游戏来说，听者漫不经心的表现是对讲解者热情的严重打击，有时甚至讲解者会在讲解过程中开始丧失动力，甚至有的时候讲解到一半就想掀桌了，因此流程的讲解可以说非常重要。笔者认为，想要完成一次能够称得上好的流程的讲解，要做到以下几点： 保持听众的疑问：在解决一个问题的解释后，紧接着提出另外的疑问，使得听众保持在求知的状态中，能够提升讲解的效率，以及保证听者的精神集中。 必须熟悉流程框架：讲解者在讲解开始前，可以不必理解游戏的每一条细则，但对于流程的大致框架则必须做到熟练，规则的讲解必须在第一时间给听者留下一个正确的印象，否则一旦讲解者意识到大的流程错误，再想改正，听者的积极性就会大打折扣，甚至没准会开始刷手机，留下讲解者一个人翻阅规则书。 边set边讲：讲解者应当尽量从set开始讲起，逐一为听者介绍游戏组件，在此期间，讲解者要有意引导听者上手进行set，可以是以要求听者帮忙拿取配件的方式展开，这样的过程能够加深听者对游戏内容的印象，也能提高一些set的速度，同时还避免了set过程中，讲解者忙着set导致的冷场。 合理暂停：很多时候，讲解者会不自觉地加快讲解速度，毕竟有着想要马上开始对局的强烈愿望，语速的加快是正常的，甚至难以避免的。因此笔者认为讲解者应当适当地暂停讲解，提供一些时间供听者消化规则。暂停的场合一般设置在单条复杂规则的讲解结束后，或对游戏卡牌、版图等涵盖丰富信息的内容讲解期间。举例来说，对于像是TTA这样的复杂游戏，一般讲解了玩家版图后讲解应当适度暂停，确定听者理解版图描述后继续进行。或是在灵迹岛的敬畏规则讲解后暂停，供听者消化敬畏的产生、循环、敬畏卡等内容，将其串连起来后进行。需要说明的是，暂停期间不代表讲解者不说话留白，而是应当进行一些简单的规则处理测验（也就是随堂小测），随机向听者提问刚刚讲述的内容的实例，鼓励听者指出规则实例的处理流程并进行评判。说白了，就是把规则书上一般会有的示例提供给听者进行演算。 分轻重缓急：对于游戏的细节内容，笔者认为不需要在规则讲解时介绍，只需要向听者说明此处规则被跳过即可。细节内容一般指部分特殊情况的处理、词条词缀关键词等规则，另一个跳过这类规则的理由是，讲解者自己甚至都有可能搞错，既然没把握让听者记住，那就干脆跳过这里，等到教学对局开始后再进行吧。例如立直麻将中的符点计算，甚至有天凤十段的选手都难以招架符点那一条条独立的细则，因此干脆就不要讲解好了，用到时再翻阅，或是留到有一定游戏经验后再讲解。 必须要有的教学关：名为教学关，实则是推新局，在这样的对局中，讲解者应当尽量确保新人的游戏体验——该放水时就放水。但也不必故意跳过某些行动，相反应当多做出一些正常游玩时的策略行动，以向新人展示桌游的真正打法。笔者认为，对于高重度的桌游讲解，重度越高越应当照顾到对方的游戏体验，毕竟能跟你打重策的朋友屈指可数，游戏体验的缺失很容易就导致玩家的流失，最后的结局就是大盒放在家中吃灰。那么如何科学合理地放水呢？笔者认为放水的最有效、也是最不那么明显的方式就是学习新人的操作，新人干什么讲解者就干什么，而在一次次的模仿当中，讲解者穿插着加入一些经验、套路、能够明显提高自身优势的操作，让新人潜移默化地学习到游戏的一些内容。 不要直接搬出套路公式：套路化的操作固然重要，但不宜在新人对局次数不多时提出，可以适当通过教学关的放水方式提出。直接讲解的套路公式会让新人缺少一款桌游开荒时的探索乐趣，而这种乐趣在套路化实现后就难以获得。 因人而异的教学相信读者都能认同，桌游规则的教学如同世界上一切教学，都是需要因人而异的。对于不同性格的新人玩家，采取不同的教学节奏能够有效提升教学的效率。这里的效率指的是听众真实掌握的内容所占讲解者讲解的内容的比例。笔者将尝试采用身边的案例，结合当前较为流行的MBTI性格分类法简单讲一下教学节奏的处理。注意笔者并非心理学研究爱好者，也并非教育学的学者，亦非桌游界的熟练讲师，本章内容的实践要多结合读者自身能力与对听众性格的判断来实现，使用MBTI分类也只是因为该方法较为流行，不代表笔者认可其科学性，如果本文写于十五年前，笔者大概会按照星座分类进行讲解。 这部分内容会按照MBTI的四组偏好进行分类讨论，而如何确定听众属于何种分类则不是本篇文章所能合理解释的内容，建议读者结合社会交流经验判断。因为笔者的桌游讲解经验无一例外都是在好友身上进行的实践，所以笔者也无法给出客观的桌游玩家分类经验。 内向与外向（E与I）：在规则讲解当中，内向的玩家倾向于主动消化吸收规则解释，而外向玩家更倾向于多次向讲解者提问的方式来掌握规则，因而讲解者面对内向的玩家时，可以多向他们提问规则内容，即使他们没有掌握内容也很少直接表现出来，因此提升互动次数是帮助I型玩家理解规则的好办法。对于E型玩家，讲解者可以减少纯讲解的内容，采用多举例的方式来帮助消化规则。 实感与直觉（S与N）：对于S型玩家，强烈建议讲解者多多举例，最好是直接使用配件摆放出来示例场景；对于N型玩家，讲解者应当尽量从大的框架角度，甚至从规则设计角度出发讲解规则。 思考与情感（T与F）：对于T型玩家，在教学中适当多加入对规则框架的补充（适当讲一些游戏的Q&amp;A内容，一些细则的介绍可能反而有助于这些玩家理解规则框架）；对于F型玩家，如果可能则尽快进入到教学关环节，在教学实战中完成大多数的讲解内容。 判断与感知（J与P）：对于J型玩家，给他们多一点思考时间，在教学关中尽量尊重他们的独立决定，只要不违背规则，就不指出操作的问题；对于P型玩家，可以让他们在教学关中成为你的下家（后手），他们可能会更多地参考你的行动来做出自己的行动。 上述方法作为经验之谈，难以给出特别实际的指示。在桌游教学中，听众的性格往往难以统一归类，因此上述讨论在实践面前就显得异常单薄，如果强行按上述讨论内容进行处理，难免出现适得其反的效果，什么都要的结果可能是什么都得不到。 桌游讲解的实践上文当中，笔者所提出来的种种要点只不过是把大家基本都认可的东西拿出来写一写，难以给有经验的讲解者带来什么新的观点，又似乎不足以使缺乏讲解经验的讲解者读得通透。所以下面笔者将会以立直麻将的教学为例，遵循上述要点，简单梳理出一个流程供翻阅，希望能够帮助到有需要的讲解者。 讲解之前的准备，自然是讲解者要充分了解规则，而对于规则复杂的游戏来说，例如大盒游戏，讲解者也很难完全熟知其中种种细节，选用立直麻将作为讲解案例也是考虑到这一点。相信桌游玩家们大都接触过麻将，其中又有相当一部分玩家接触过立直麻将。熟悉立直麻将的玩家应该会清楚，尽管日麻规则的上手并不难，但日麻的役种、点数计算却是需要相当的对局经验才能慢慢掌握的，即便是日麻的忠实玩家，也不一定能够一下子列出日麻规则中的役种、符点。笔者会将日麻规则中这部分需要经验积累、难以在初学阶段学习的规则列为“轻重缓急”当中讲解顺序最靠后的那一类，大部分此类规则可以说毫无记忆的必要，多数情况只需要使用日麻的点数计算工具或查阅表格或是干脆简化分数计算方式来实现。如果是网麻，那么所必须记忆的内容就更少了。 背景介绍：日麻没有什么背景可以介绍，因此这部分可以跳过，由于其流行性，若是时间充足讲解者可以提前引导玩家去看一些日麻动漫之类的作品，或是讲一下麻将的起源与发展。 目标介绍：那么实际要做的就是一上来介绍麻将的目标，麻将的主要目标即是“和（胡）牌”，和牌的同时又要兼顾点数，在提高和牌收入点数的同时保证和牌概率不会太低，总的来说是一种动态规划问题，如何权衡和牌与和牌大小是区分菜鸟与高手的重要判据之一。 由上述目标，自然可以引出“什么是和牌”这一疑问，带着这样的疑问，讲解者此时就可以代入游戏的流程“抓牌、切牌”，重复这样的流程，在这样的基本流程当中存在着吃、碰、杠、立直的选项，这些选项能够使玩家逐渐将手上的牌凑出和牌的牌型，进而取得对局的胜利。按上述流程的说明，大致的框架就交代清楚了。注意上述内容中不要针对吃碰这样的内容进行详细展开，可以不讲，也可以简单几句带过，否则听众无法树立起日麻的规则框架，后续的规则理解会支离破碎。 大致框架讲解完毕后，讲解者应当带领听众进入游戏set过程，在set过程中逐一解释日麻茫茫多的术语词汇的一部分，如牌山、王牌、岭上、副露、牌河、dora、自风、场风等，依然是不要过度展开。其实这些词汇中有很多就是一个特定称呼，只要引导听者尽量记住即可，码牌过程中可以多次提问并要求听者作答以加深印象，甚至可以要求听者为讲解者重复讲解一遍。 之后就进入到对局，第一局大家可以以公开手中的牌的形式进行。对局正式开始前，讲解者先通过实际举例的方式讲解和牌的基本判断，由此衍生出役种的介绍，注意尽量只介绍常见一番、二番役即可，也可以加入一些夸张的役种介绍，如九莲宝灯、国士无双等满贯役种，可以配合一些夸张的讲解活跃一下气氛。这之后就是摸牌切牌的循环，讲解者时不时地讲解自己为什么这么打、这么打了之后会有什么变化，进而代入其他的内容，如门前清、吃碰、顺刻、明暗刻&#x2F;杠等，以及振听这样的初学者最常犯的错误、断幺九、立直等最常见的和牌役种。整个对局中，讲解者应当观察听者的反应，如经常在切牌时迟疑，可以主动为其重复和牌役种、和牌的牌型等内容要点。如果听者有些泄气（产生一些厌烦心理），则可以主动提问听者，使其注意力回到教学当中。讲解者应当避免使用命令式的语气，亦要避免自己陷入消极状态——既然决定要讲解，那就努力做到最好，不要让听众影响你的情绪，不要在新人犹豫不知切什么牌的时候催促、命令，要时刻观察对方的状态，如果是在积极思考，可以说一些鼓励的话；如果是不知所措，那么就如上所述，使用提问将新人的思绪拉回到麻将上。 当可以比较轻松地完成一场明牌的麻将对局流程后，主要的教学工作可以说已经成功结束了。接下来就是进行慢速的、无计分的常规流程麻将，此时讲解者可以拿出准备好的役种提示纸（如果麻将牌没有附带役种提示就自己网上找一找打印出来），尝试代入完整的役种类型进行对局。在此后的对局中，讲解者逐渐加入点数计算（点数计算也可以先一律按符数&#x3D;底符&#x3D;30点规则进行，毕竟讲解者也大概不太会算）、完整半庄战等，可以适当放慢切牌的速度，加入一些防守策略、牌效的介绍，让新人们知道“哦，原来日麻高手是这样理解日麻对战的”，此后的对局会越来越流畅。因为麻将单个对局的运气成分明显，讲解者也可以毫无保留地放开了打，最好是做一些满贯出来，毕竟新人都是怪物，现在不抓住稍纵即逝的机会以后可能就再也遇不到了:)。","categories":[],"tags":[{"name":"boardgame","slug":"boardgame","permalink":"https://g4ng4n.github.io/tags/boardgame/"}]},{"title":"A Bravo New Blog","slug":"A-Bravo-New-Blog","date":"2023-12-19T15:30:57.000Z","updated":"2023-12-19T16:20:02.171Z","comments":false,"path":"2023/12/19/A-Bravo-New-Blog/","permalink":"https://g4ng4n.github.io/2023/12/19/A-Bravo-New-Blog/","excerpt":"","text":"又要到饭了，兄弟们！","categories":[],"tags":[{"name":"life","slug":"life","permalink":"https://g4ng4n.github.io/tags/life/"}]}],"categories":[],"tags":[{"name":"boardgame","slug":"boardgame","permalink":"https://g4ng4n.github.io/tags/boardgame/"},{"name":"life","slug":"life","permalink":"https://g4ng4n.github.io/tags/life/"}]}