{"meta":{"title":"It is a blog.","subtitle":"这个小盒才是你永远的家","description":"计算机/开发/逆向工程/游戏/英语/数学","author":"G4ng4n","url":"https://G4ng4n.github.io","root":"/"},"pages":[{"title":"[404]","date":"2023-12-19T16:07:03.446Z","updated":"2023-12-19T16:07:03.446Z","comments":true,"path":"404.html","permalink":"https://g4ng4n.github.io/404.html","excerpt":"","text":""},{"title":"关于我 / About Me","date":"2023-12-19T15:56:28.000Z","updated":"2023-12-19T16:01:04.701Z","comments":true,"path":"about/index.html","permalink":"https://g4ng4n.github.io/about/index.html","excerpt":"","text":"经历 C2学校软工专业，本科 毕业在微型企业工作约两年 把公司干倒闭了 本科主要搞的是安全，但在公司期间啥都干 正在备考TOEFL，梦想是留学，妈的英语怎么这么难 技术上的梦想是渲染&#x2F;游戏开发"}],"posts":[{"title":"杂谈——提高TRPG模组的泛化能力","slug":"杂谈——提高TRPG模组的泛化能力","date":"2024-08-13T12:56:34.000Z","updated":"2024-08-13T15:40:47.327Z","comments":true,"path":"2024/08/13/杂谈——提高TRPG模组的泛化能力/","permalink":"https://g4ng4n.github.io/2024/08/13/%E6%9D%82%E8%B0%88%E2%80%94%E2%80%94%E6%8F%90%E9%AB%98TRPG%E6%A8%A1%E7%BB%84%E7%9A%84%E6%B3%9B%E5%8C%96%E8%83%BD%E5%8A%9B/","excerpt":"","text":"概述本文围绕着TRPG难以流行的问题进行分析，总结了一些被跑团玩家经常表述的原因，同时提出了一种作者的个人观点，即主要问题在于现有TRPG模组，针对该问题引入了机器学习“泛化能力”这一概念，试图对模组问题进行拆解分析。然后，针对拆解后的几个子问题提出了一种可能的解决方案。作者希望本文的观点可以被用于帮助TRPG这一优秀游戏类别摆脱增长缓慢的难题。 前言 在机器学习任务中，模型根据已采集的数据进行训练，再将学习到的规律应用在未知的同类型数据上。因为训练的目的是实际应用，所以我们不是非常关心训练的正确率，而是重点关心模型在实际任务（未知数据）上的正确率。 在提升正确率（精度）的基础上，机器学习的一个极具挑战的难点在于提升模型的泛化能力。模型的泛化能力越强，意味着模型在大量未知样本上的表现越好（预测准确率越高）。这就是机器学习的终极目标。一般来说，提升模型泛化能力的最主要方式就是加大训练样本量，只有“见识过”形形色色的数据，才能更好地应对未知。 别担心，标题没有写错，这篇文章是关于TRPG（桌上角色扮演游戏）的。为什么要提到“泛化能力”呢，或者说，针对TRPG模组的“泛化”能力指的是什么呢？在正式给出我自己的定义前，我需要先介绍一下某些现象。 为什么TRPG火不起来喜爱TRPG的玩家不会陌生，由这一类桌游衍生而来的电子角色扮演游戏，CRPG，一直在电子游戏领域占据着一席之地，尽管不比最流行的第一人称射击、多人竞技、体育、赛车类游戏，但始终有新人加入这个游戏类别，因此CRPG这个游戏类别一直以来还算健康。特别是拉瑞安的《神界：原罪2》、《博德之门3》曾多次制造游戏圈的火爆话题。在我看来，这反映出一个现象，CRPG不缺少新鲜血液、不缺少玩家基数。由此引出了一个问题，为什么TRPG难以做到CRPG一样的热度呢（在对应的目标游戏群体中）？按常理说，至少有相当一部分CRPG玩家喜欢游戏带来的沉浸式的剧情体验，那么TRPG的玩家群体应当至少和CRPG玩家人数形成一定的线性关系，可是事实上似乎并没有发生这样的情况。 先不着急回答这个问题，这个问题也并不是本文要讨论的主要问题。如果让TRPG玩家们总结TRPG火不起来的原因，相信玩家们一定会条件反射式地列出来TRPG的几点罪状：没时间、规则繁重、没有固定车队等。在这里我想提出我的一条观点作为补充（我确信我一定不是第一个提出这个观点的人，但也确信本文的观点没有进行抄袭），那就是TRPG的问题出在了模组上，这是一个严重的问题。 首先，国内已经拥有了不少的桌游玩家、剧本杀玩家，但TRPG玩家数量依然没有比较明显的增长（身边统计学，没有客观数据支持，仅从话题讨论度出发作出草率判断）。我们不妨把“罪状”收缩到桌游、剧本杀这类带有社交性质的游戏领域内来讨论，“没时间”在这里显然不再是一个主要原因：无论是桌游还是剧本杀都不是短时间的休闲方式，对应的时间在TRPG中已经可以顺利地跑一次团了，而一个短模组大概两三次就可以完结；“规则繁重”或许是一个原因，但国内也已经有相当数量的中轻量规则的官方引进、民间汉化，其中不乏公认的佳作，如命运、祸不单行等，这些规则实际的玩家数量更是稀少；“没有固定车队”我承认是原因之一，但并不看作主要原因，剧本杀也有经常约局、参加游戏之外互不相识的“搭子”，为什么TRPG很少见到呢？ 模组的问题，在于绝大多数模组要求一个经验非常丰富的主持人，对主持人能力的高要求是TRPG开团稀少的一个主要原因。先不必提固定车队、规则繁重等问题，连合格的主持人都找不到，如何“跑”得起来？这一点可以在剧本杀行业看到明显的证据，高质量的剧本杀店的主持人都要有专业的主持培训课程、剧本创作都有付费的写作教学，剧本杀店的口碑除了靠基础的店内环境，最多的就是靠主持人个人能力作为宣传。当然，主持人培训和剧本创作培训放在TRPG中并不是十分适用：TRPG的领域范围太广、风格太杂了，创作、主持等行为很难公式化地应用在不同的规则中。但为什么到了TRPG，大家反而不是很喜欢提及这些实际的“刚需”呢？ 以DND、COC等主流TRPG规则为例，这些规则有着太多的优秀模组创作者，为玩家们贡献了海量的奇妙探险故事，可是鲜有“新手主持人”友好的模组，像是COC规则下，多少年过去了，大家还在推荐追书人、闹鬼作为新入门模组。模组的创作似乎走入了一个倒金字塔结构：（对主持人而言）难度低的模组稀少，难度高的模组一大堆。这里的难度包括但不限于： 备团：从大量战斗数据的整理、到NPC性格特点的琢磨、到pc角色卡创作指导&#x2F;审卡、再到旁白文字的扩写、剧情走向的预演等，每准备一次新模组对主持人来说都是一次苦行。 节奏控制：对于非常常见的非线性叙事模组，主持人对剧情走向的把控能力需求非常大，一旦主持人忘记剧情重点，或觉得难以提示PC某些关键信息，从而导致模组叙事节奏被打乱，马上就会导致团的沉浸感被打破，整体的体验连续性被扰乱。试想一下你在CRPG的剧情演出中遇到BUG导致存档丢失的恼火场面，我就是这个意思。 风格：主持人不一定非要有自己的个人风格，但也应当对模组维持足够的热情，使得一次跑团不会出现主持人觉得枯燥的情况，这会让一个模组在预定的剧情高潮中走向一个尴尬的低迷状态，并最终变为整体崩塌。 模组的泛化能力带着这些问题，终于可以对模组所谓的泛化能力进行一个简单的定义：模组的泛化能力，是指同一个模组在不同风格、不同经验丰富度的跑团团队中的平均游玩稳定性，稳定性即指团的整体节奏维持的难度。提出所谓泛化能力，是想探索解决上述模组问题的方式。有了这个定义，就可以称模组的问题是“泛化能力不够高”的问题。 让我们针对定义出发，尝试拆解问题。模组的泛化能力低下问题来自于： 无法适应多风格的跑团，即模组无法提供足够的自由度，换句话说，模组创作时就已经掺入了过多的创作者风格。 不能照顾到缺乏经验、但又有着极高热情的新玩家们。 模组叙事水平弱，本身写作就没有梳理好主次关系、没能把握住故事脉络。创作者尚且没能搞清楚自己要讲什么故事，玩家们只会更加头痛。 “冒险书化”替代传统模组书写我很早就形成了上述模组问题的观点，但从未思考过如何很好地解决这个问题。显然，只玩公认的高质量模组、自己创作修改模组是两个看起来不错的选项，但依然经不起考验：流行的模组大多有第二个问题，而自己创作模组很可能存在第一个和第三个问题，毕竟点评模组和创作模组不是同一件事情。 事情在最近发生了变化，最近心血来潮将COC规则下的《暗夜独行》单人冒险书拿出来进行单人游戏，借此突然萌生了将模组“冒险书化”的想法。于是我立刻叫来了朋友，尝试以KP-PC的身份，用冒险书进行常规的跑团，效果竟然意外地不错。实际的带团效果在叙事、旁白、检定中达成了一个惊人的平衡。于是我立刻联想到模组问题也许可以参考这类单人冒险书来解决：给模组加以一定的限制、将其冒险书化。 诚然，跑团最重要的乐趣来源之一就是无限的自由度，但如果我们只是将超游的那部分自由度删去呢？此办法应当不适用于喜欢超游发言的团队，但这样风格的团队应当也不会将泛化性低视为一个阻碍游戏的问题。 说回到这个解决办法，模组的冒险书化是在备团阶段发生的。要将模组冒险书化，意味着： 对于不同的场景事件，基于各个可能的分支走向设置一个条目，条目中留有一些叙述性质的文字和不同条目之间的跳转（标记着其他的条目号），主持人可以在团中直接复制该文字，加上即兴的扩写，以取得出色的代入效果。 对于剧情内的难题，从规则书的检定系统出发，针对性地设置不同的检定选项，例如对NPC的某个请求可以借助说服、花言巧语、威胁等检定实现。这样做一定会增加备团的时间长度，但好处也是显而易见的：主持人可以将这些检定结果模块化，复用在其他的备团过程中，第二次使用时只需要复制粘贴。 对于战斗类场景，为NPC预先设置战术方案。我承认在DND这样的复杂战斗规则中并没有找到特别好的冒险书化办法。但如果游玩的是弱战斗风格的团、或是弱战斗处理的规则，则效果会好一些。 梳理条目间关联图，这可以帮助主持人快速掌握情节脉络，掌握分支。 【可选】为模组剧情设置时间表、拟定时间流逝规则、规定游戏时间限制、量化地处理游戏内PC的冒险节奏，还可以依照时间表设置剧情的变动，结团后可以按时间表梳理故事过程。但本项要求主持人对模组本身较为了解，本项的工作量也并不小，因此使用时间表需要慎重考虑。 在这里推荐使用obsidian一类支持内部链接的笔记软件，以实现条目间的快速跳转、条目关系图谱生成。对于面团，主持人可以试着将不同条目记录在不同便签纸上。总之冒险书化后的模组应当是非线性的：不同条目的关系连结成一张网（无向图或者有向图），从任何一个点切入都可以连接到其他的点。可视化还能清晰地反映出哪些节点（条目）是重要的：它们连接着更多的边！ 回到泛化性问题上，冒险书化很好地回答了泛化性低下问题： 无法适应多风格的跑团：主持人在每一个条目中都有着高度自主权，可以任意改写条目，只需要保证几个关键的剧情条目走向所连接起来的“剧情骨架”是稳定的即可，这同样降低了风格创作的难度。 不能照顾到经验不足的团队：这正是冒险书方案主要解决的问题，条目化、选项限制就是为这个而生的，团队只要按部就班就能得到一个至少是及格水平的游戏过程。保证了下限也就不会 叙事水平：条目化+关系图谱可视化可以轻松地让主持人分析剧情重点，如果被改写的模组有意突出某个事物但由于疏忽或水平不足而没能做到，应当可以在关系图谱上看到该事物的对应节点的度（相连的边）与其他节点相比差不多，此时主持人就可以添加一些新的条目，尝试将其连接在该事物周围并试图与其他节点相连（尝试关联到一些已有条目）。所以叙事水平参差不齐的问题也能够得到有效地解决。 前面提到了，冒险书化本身引入了一个新问题：自由度被破坏。对于这类情况，主持人有两种解决办法：第一个是直接告知PC，“这个选择行不通，再换一个”，以及即兴解释一下不能这样做的原因。这个原因应当在备团时就被考虑过了，我认为即使是新人主持人也可以容易地做到这点，大不了按照技能列表一条条地排查；第二个是即兴创作新的剧情，主持人允许PC这样做并为此创作一个新的条目！创作的新条目根据关系图谱尽可能地连接到离当前的节点的相邻节点距离近一些的位置即可。 最后，冒险书化的模组写作方式既可以改造大量经典的模组，又可以以此法创作新的模组。如果模组创作者对这个稍显零碎的非线性创作方式不太适应，依然可以以经典的方式创作模组，然后自己进行改造，这不会多费太多时间的。 对于冒险书化最重要的“条目”概念，我的个人建议是条目的划分应该符合以下前提，只要满足任意一条，就应当将模组中的这一段整理为一个独立条目： 模组的某一段表示了剧情的强烈转折。 模组的某一段要求进行一个检定，并会导致不同的走向。 模组的某一段描述了一件物品&#x2F;一段故事内文本。 模组的某一段描述了一次战斗遭遇。尽量保证同一条目下记录了完整的战斗遭遇，不要将战斗中的NPC决策拆分为多条目，除非这是一场非常重要的战斗，如一场长战役的高潮部分，战斗会非常激烈与精彩。 模组的某一段描述了角色的登场亮相或死亡。 模组的某一段描述了剧情的开端或结局。 同时，每一个条目都应当具有全部的以下要素： 叙述文字。这些文字可以直接被主持人念诵使用。 跳转条目。这标注了当前条目结束后所有可能的下一步。 检定信息，如果条目需要进行检定的时候。 对于部分条目，还可以选择性地设置可选要素： 【可选】跳转前条目。如果主持人认为需要，可以把跳转前条目的编号也计入，这为某些需要返回上一条目的情况提供了便利。 【可选】主持人笔记。主持人可以自由发挥，写下一些非正式的条目内容，这可以帮助主持人在处理复杂剧情时快速回想起重点，以控制住跑团节奏。 冒险书化方式与卡片笔记法有很多相似之处，读者也可以尝试通过学习卡片笔记法来辅助进行冒险书化整理。 结尾本篇杂谈的创作并没有经过什么梳理，几乎是头脑风暴式地想到哪写到哪，因此可能有一些混乱，可能会在以后重新整理。此外在写作时有些一闪而过的念头没来得及加入到文章中，在未来的整理中也会尽量回忆、重新构思这些小想法。 本文无意对任何现有的观点提出挑战，仅仅是作为一名TRPG玩家提出一些个人观点。 本文后续将在未来的某些时间将一些经典COC模组（比如40周年纪念版规则的那几篇）进行冒险书化。虽然提出了这种方法，但我并没有实际的过多实践，很多总结性质的发言实际上是依靠阅读冒险书类游戏提出来的，如有错误欢迎指正。","categories":[],"tags":[{"name":"桌游","slug":"桌游","permalink":"https://g4ng4n.github.io/tags/%E6%A1%8C%E6%B8%B8/"},{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"},{"name":"TRPG","slug":"TRPG","permalink":"https://g4ng4n.github.io/tags/TRPG/"}]},{"title":"几何竞技场分析","slug":"几何竞技场分析","date":"2024-06-03T08:25:29.000Z","updated":"2024-08-13T15:49:18.292Z","comments":true,"path":"2024/06/03/几何竞技场分析/","permalink":"https://g4ng4n.github.io/2024/06/03/%E5%87%A0%E4%BD%95%E7%AB%9E%E6%8A%80%E5%9C%BA%E5%88%86%E6%9E%90/","excerpt":"","text":"今天遇到steam上的Geometry Arena特价，正好steam钱包里有一些余额，于是买下了这款早有耳闻但没有玩过的时尚精品小游戏。 本人对roguelite游戏的一贯的态度是，对于永久升级类解锁项目一般都会通过修改的方式提前解锁，即尽量以全解锁的状态游玩此类游戏，所以面对这款小游戏也第一时间准备进行修改，不料却遇到了一些阻力。 最初的问题是CE定位不到游戏内数据，如星星、符文等，第一时间联想到数据进行了加密处理，所以用dnspy看了一看，还好作者没有把游戏加壳… 加密逻辑如下（star和geometry coin同理）： 1234567891011public long Star &#123; get &#123; return (19960614L - this.starEnc) / 140933L; &#125; set &#123; this.starEnc = 19960614L - value * 140933L; &#125; &#125; 那么作者想必是1996年6月14日出生的吧（我超盒！ 当初看到这里以为可以搜到starEnc了，但实际操作下来还是没找到这个值，然后发现starEnc的类型是ObscuredLong，搜索了一下发现这是个常用于游戏反作弊的数据类型，内部有加解密的方法。而估计是为了不过多影响性能，或者作者也没特别注意加密手段，加解密实际上就是进行了一次异或计算，并且密钥也没有过多隐藏，可以找到是private static long cryptoKey = 444442L;。 然后又想到修改游戏存档，因为这个游戏本身比较简单，游戏存档应当也较容易处理，经过搜索，果然存档也经过了加密，不过密钥是直接明文写入的，不知道作者是什么意思（ 1234567891011121314151617181920212223242526272829303132public static class MyEncrypt&#123; public static string Encrypt(string content) &#123; byte[] bytes = Encoding.UTF8.GetBytes(MyEncrypt.key); ICryptoTransform cryptoTransform = new RijndaelManaged &#123; Key = bytes, Mode = CipherMode.ECB, Padding = PaddingMode.PKCS7 &#125;.CreateEncryptor(); byte[] bytes2 = Encoding.UTF8.GetBytes(content); byte[] array = cryptoTransform.TransformFinalBlock(bytes2, 0, bytes2.Length); return Convert.ToBase64String(array, 0, array.Length); &#125; public static string Decipher(string content) &#123; byte[] bytes = Encoding.UTF8.GetBytes(MyEncrypt.key); ICryptoTransform cryptoTransform = new RijndaelManaged &#123; Key = bytes, Mode = CipherMode.ECB, Padding = PaddingMode.PKCS7 &#125;.CreateDecryptor(); byte[] array = Convert.FromBase64String(content); byte[] bytes2 = cryptoTransform.TransformFinalBlock(array, 0, array.Length); return Encoding.UTF8.GetString(bytes2); &#125; private static string key = &quot;08060811013731401016042185144900&quot;;&#125; 上述是存档的加密逻辑，就是AES的ECB模式，用了PKCS7填充法，密钥也是给的整32位的不需要再补位，整个加解密非常好处理。但是问题出在了存档设有多个备份文件（大概十几个），由于没什么修改存档的经验，又不太想看存档的整个逻辑，首次尝试不成功之后就放弃了这个办法。真要搞的话应该还是能搞出来的，就是不如直接修改来得快。maybe有什么存档检查的机制，作者为了不让大家作弊还真是下足了功夫。 根据上面的加密逻辑的分析，假设玩家当前游戏内星星的值为10000，那么由逻辑可知，根据(19960614L - (真实星星 ^ 444442L)) / 140933L == 10000可以解出“真实星星”，即内存中星星的值应当为-1389809716。去内存中搜索该值即可，注意由于数据类型是long，搜索时直接按8字节数据搜索。 1234567891011using System; public class Program&#123; public static void Main() &#123; long star = 100000; long star_in_memory = (19960614L - star * 140933L)^444442L; Console.WriteLine(star_in_memory); &#125;&#125; 既然游戏本身是C#的程序，建议大家还是用C#程序进行解密，我这里在线随便找了个C# playground在线运行代码。 示例如下： 如图是已经修改成功的游戏界面，按计算出的内存星星值搜索，可以直接定位到一个地址： 假设要将star改回到100000，那么首先计算新的内存星星值，为-14072993252，修改后进入一次符文商店刷新一下星星显示： 可以看到修改成功。符文数量逻辑和星星一模一样，这里就不多解释了，按上述办法修改即可。没怎么鼓捣过CE的脚本，所以就止步于手工计算这了，毕竟修改一次就行了。 同时也没想过修改其他对局内角色数据来打无尽，所以就没研究。修改对局内的数据思路理应和上面是一致的，行不通的话那就说明没通过这个办法加密，还请自己研究。","categories":[],"tags":[{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"}]},{"title":"SMG桌游究极马拉松桌游购买清单","slug":"SMG桌游究极马拉松桌游购买清单","date":"2024-03-05T03:09:15.000Z","updated":"2024-08-13T12:58:54.842Z","comments":true,"path":"2024/03/05/SMG桌游究极马拉松桌游购买清单/","permalink":"https://g4ng4n.github.io/2024/03/05/SMG%E6%A1%8C%E6%B8%B8%E7%A9%B6%E6%9E%81%E9%A9%AC%E6%8B%89%E6%9D%BE%E6%A1%8C%E6%B8%B8%E8%B4%AD%E4%B9%B0%E6%B8%85%E5%8D%95/","excerpt":"","text":"注：由于中文版几乎没可能继续跟进，下方售价只记录英文版。均不含邮费。 生物进化 游戏 官网&#x2F;amazon&#x2F;ebay 闲鱼&#x2F;淘宝&#x2F;京东 Bios Origins Board Game [2nd edition] 89刀 550-588 Bios Megafauna Board Game [2nd edition] 89刀（售罄） Bios Genesis Board Game [2nd edition] 55刀（售罄） 空间探索 游戏 国外 国内 【基础】High Frontier Board Game 高边疆 99刀 【基础】Interstellar Board Game 星际穿越，接高边疆内容 89刀 640 【扩展】High Frontier 4 All [Module 1] - Terawatt Add-on 25刀 【扩展】High Frontier 4 [Module 2] - Colonization Add-on 29刀 【扩展】High Frontier 4 [Module 3] - Conflict Add-on 29刀 【扩展】High Frontier 4 [Module 4] – Exodus Add-on 29刀 260 【扩展】High Frontier 4 [Module 5] - Economy Add-on 29刀 【promo】High Frontier Promo Pack 1: The Station Pack（售罄） 10刀&#x2F;10欧 【promo】High Frontier 4 All promo pack 2 Achievements 10刀&#x2F;10欧 【配件】High Frontier 4 All Spectral Factory Cube 带光谱字母的工厂方块 15刀 【配件】High Frontier 4: All Tools 1 Pack 快速开始卡牌+未来任务卡牌 25刀 【配件】High Frontier 6th Player Component Kit 第六名玩家配件 25刀 【配件】High Frontier 4: Neoprene mat 橡胶桌垫版图 54刀 【gamefound】【游戏性allin】High Frontier All-In!（基础+5扩展） 199欧≈220刀 【gamefound】【配件allin】High Frontier 4 All kit me up（第六名玩家+工具包1+桌垫+工厂骰子） 99欧≈110刀 【gamefound】Interstellar journey（基础+桌垫） 119欧≈132刀 【gamefound】【究极allin】All the known High Frontier Universe（高边疆游戏性allin + 配件allin + Interstellar本体，含邮费约4400） 399欧≈442刀≈3117rmb","categories":[],"tags":[{"name":"桌游","slug":"桌游","permalink":"https://g4ng4n.github.io/tags/%E6%A1%8C%E6%B8%B8/"},{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"}]},{"title":"哈德良长城策略浅谈","slug":"哈德良长城策略浅谈","date":"2024-03-04T11:32:47.000Z","updated":"2024-08-13T12:58:41.515Z","comments":true,"path":"2024/03/04/哈德良长城策略浅谈/","permalink":"https://g4ng4n.github.io/2024/03/04/%E5%93%88%E5%BE%B7%E8%89%AF%E9%95%BF%E5%9F%8E%E7%AD%96%E7%95%A5%E6%B5%85%E8%B0%88/","excerpt":"","text":"浅谈哈德良长城刷分目前玩了几十局哈德良长城，对游戏的大致策略有了一定的看法，在这里简单点评与分析一下游戏的各个部分，并谈一谈目前的游戏策略——工事流。目前最佳93，最差55。 首先点评一下游戏整体：套路看起来多实则固定、运气成分很不讨喜，复杂度足够但缺乏深度的纸笔游戏，且几乎只适合单人游玩。但鉴于纸笔游戏始终缺乏一款重度高的作品，哈德良长城作为填补这一空白的作品来说是说得过去的。想体验高重度纸笔的玩家可以尝试，不建议一般德式玩家入手。 太长不看版： 个人认为，左侧工事类内容是发展重点，主要靠刷满堡垒+城墙的思路拿下大量公民去发展右侧，军团+城墙卫队一般一并发展，在士兵数量不足的情况下可以考虑军团和卫队各爬满两组，迎合路线卡的2VP。这样，三条轨产出 右侧公民部分则偏重于公民换取公民轨奖励、花园、法院，在命运牌给的士兵较多的对局中，还可以刷侦察，否则士兵应当优先服务于堡垒 极简模型由于哈德良长城是一个依靠打出工人刷分的游戏，因此所有的分析都围绕分数——平均工人投入的比例展开。而由于游戏中前置科技要求的广泛存在，不同分轨之间大多存在一定的关联性，在分析时不考虑这样的前提，只独立分析选取的区域。 个人喜欢将左侧军团、采伐、拒马、卫队、城墙、堡垒、粮仓放在一起考虑（简称为“工事”部分）。值得一提的是，目前对局中笔者的高分都是依靠“工事”部分几乎填涂满得到的，而低分对局中“工事”部分几乎都有所缺失。 由于游戏中的公民（黄&#x2F;y）、建筑工（蓝&#x2F;u）、士兵（黑&#x2F;k）、奴隶（紫&#x2F;p）基本上都能依靠combo实现直接或间接的转换，因此在这里将这几种米宝的“价值”视为等同的1工人，记为y&#x3D;u&#x3D;k&#x3D;p&#x3D;1w。士兵稍微稀有一些，大约是1.1-1.2w左右。而资源（灰&#x2F;g）由于资源产量提供了额外产出，因此价值要低于1w，根据每轮生产比例，也为了方便计算，设g+k&#x3D;2w。实际计算g的价值要考虑到命运卡的平均产值（有空算一下）。有了上述对游戏内不同种类资源价值的定义，数学模型的分析可以方便展开。 军团的模型如下： 单路军团阶段性投入 阶段产出 截止到本阶段的总产出&#x2F;平均产出 1 0 0 2 0 0 3 1 1&#x2F;0.33 4 0 1&#x2F;0.25 5 1 2&#x2F;0.4 6 1+1（路线卡） 4&#x2F;0.67 简单来说，对于每一路军团，升至3或者升满是一个理想状态。并且军团的实际分数收益是很高的。同时还有隐含的入侵防御奖励分数和防止鄙视的分数（对于前几个鄙视，漏掉一个敌人约相当于扣2分）。因此军团是值得冲的轨之一。另外，军团满级的平均产出0.67分基本上是游戏中的平均产出上限（考虑到地标建筑只有属性要求，性价比略低于1u2g的地标建筑），遇到这样的上限需要尽力去追，以期望得到高分。军团的缺点在于其只能通过标记填涂来推进，因此综合考量游戏节奏，军团性价比略有损失。 由于工事部分直接或间接依赖于堡垒，因此从堡垒轨开始进行分析，在堡垒轨中为了方便分析，将b、k价值统一为1w；由于科技等级本身没有直接影响，因此跳过这部分；军团符号产出记为0.5分： 堡垒阶段性投入 阶段产出&#x2F;平均1w产出 截止到本阶段的总产出&#x2F;平均1w产出 4w 1w&#x2F;0.25w 1w&#x2F;0.25w 6w 1w&#x2F;0.5w 2w&#x2F;0.33w 7w 1&#x2F;1 2w+1&#x2F;0.29w+0.14 1w 1w&#x2F;1w （计入中型粮仓3w）3w+1&#x2F;0.14w+0.05 2w 1w&#x2F;0.5w 4w+1&#x2F;0.17w+0.04 2w 1w&#x2F;0.5w 5w+1&#x2F;0.2w+0.04 2w 2.5&#x2F;1.25 5w+3.5&#x2F;0.19w+0.13 2w 1w&#x2F;0.5w （计入大型粮仓4w，产出1）6w+4.5&#x2F;0.18w+0.14 2w 1w&#x2F;0.5w 7w+5&#x2F;0.2w+0.14 2w 1w&#x2F;0.5w 8w+5&#x2F;0.22w+0.14 1w 1.5&#x2F;1.5 8w+6.5&#x2F;0.21w+0.17 可以看出，单独堡垒的收益并不高，但堡垒的强大之处在于拒马以及城墙的收益： 拒马阶段性投入 阶段产出&#x3D;平均1w产出 截止到本阶段的总产出&#x2F;平均1w产出 1w 0 0 2w 0 0 3w 0.5 0.5&#x2F;0.17 4w 1 1.5&#x2F;0.38 5w 0.5 2&#x2F;0.4 6w 1 3&#x2F;0.5 7w 0.5 3.5&#x2F;0.5 拒马的总投入产出等式为：7w&#x3D;3.5，评价为稳健朴实，一旦选择“工事”流派，那么拒马就尽量不要错过。 由于拒马没有对应的路线卡，因此拒马留下最后一个军团标记不升级也是可以的，实际操作中可以留下这个军团标记，期待用这个标记产出连锁军团产出达成combo。因为城墙的路线卡极易达成，因此将路线卡也计入城墙产出中 城墙阶段性投入 阶段产出&#x3D;平均1w产出 截止到本阶段的总产出&#x2F;平均1w产出 1 1w 1w 2 0 1w 3 1w 2w 4 1.5 2w+1.5 5 1w 3w+1.5 6 0 3w+1.5 7 0.5+1路线卡 3w+3 8 1 3w+4 9 1w 4w+4 10 0 4w+4 11 1.5 4w+5.5 12 0 4w+5.5 13 1 4w+6.5 14 0.5+1路线卡 4w+8 15 1 4w+9 16 1w 5w+9 17 0 5w+9 18 1.5 5w+10.5 19 1 5w+11.5 20 0 5w+11.5 21 0.5+1路线卡 5w+13&#x2F;0.24w+0.62 单论城墙的性价比，略低于拒马，但其直接名誉的产出、更多的军团标记、相对优秀的工人产出比、轻松配合路线卡拿到3vp，种种有点使得城墙的优先级要大于拒马。 通过前面几个表格的简单分析，我们差不多可以给工事部分的产能做一个总结：平均投入1工人可以换回0.2工人+约0.5左右的VP。同时城墙优先级略高于其他部分的优先级，而且军团要和卫队组合发展。采矿伐木没什么说的，尽量拉满或者剩一产能（靠商业区补充）。 总体点评 练兵场和集会场：性价比很可以，不要觉得集会的2换1是血亏，2:1的投入产出比实际上是非常划算的。 左侧小型建筑：完爆大型，同时街道性价比成立的前提是前四年建出（第四年最低4w&#x3D;3，第五年开始就很差了），而街道属于昂贵建筑，前期建造很容易损失节奏，导致combo减少，个人不喜欢拿，建议如果想拿就早拿。 地标：第六年冲分利器。在至少三个分轨差距不大的情况下，能造一定造。 鄙视：其实问题不大，无浴场情况下控制在4个以内还是很简单的。 公民通用轨：能爬就爬，尽量留几个、留空白给花园。 商业区：小型必拿，中型可以拿，大型亏，不建议拿，除非最后一年资源过剩+冲路线卡。 市场：可造可不造，造了一定要冲满，至少也冲够5个数字，否则亏。 剧院：如果第一年士兵少，不适合走军团+卫队，那就造剧院，最晚第二年造出来并且开始演出，后续性价比一般。 角斗场：贵，狗都不造，血妈亏，觉得自己强运可以试试。 花园：必拿，没任何理由不拿。 神庙：4-6年可以刷1-2个用来消耗卡手的米宝，也可以直奔恩惠，但工人投入大，前期亏节奏，除非后期放弃军团，否则没太大必要修神庙。 浴场：血亏的赔钱货，如果你的鄙视多于5个，那还是反思一下发展路线，下局刷城防吧。 法院：白嫖无敌。1-4年推荐造，之后不建议造。如果前四年年开始命运卡送的紫人较多可以考虑放弃这部分。 外交官：如果放弃左侧的话应当尽早点出，否则意义不大。 侦察兵：士兵多&#x2F;缺石头就蹲个1*4的长条阵，然后刷这个，配合路线卡还能有3VP，挺不错的。 通常状态下，左侧基本刷满（卫队2组、军团2组、城墙刷满）时，公民轨也能够爬满，基本上四个属性能到60+，路线卡10+，总分80上下。理想状态下，可以做到四个属性75上下+路线卡15以上，总分90+。不过听说曾有人打出100+，那也只能佩服了，也许游戏局数多起来之后足够幸运时可以做到吧。虽然理论满分是118，但其实大家可以把这游戏作为100满分的卷子去答。","categories":[],"tags":[{"name":"桌游","slug":"桌游","permalink":"https://g4ng4n.github.io/tags/%E6%A1%8C%E6%B8%B8/"},{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"}]},{"title":"配方搜集——纸杯蛋糕","slug":"配方搜集——纸杯蛋糕","date":"2024-01-29T03:37:54.000Z","updated":"2024-03-04T11:30:19.159Z","comments":true,"path":"2024/01/29/配方搜集——纸杯蛋糕/","permalink":"https://g4ng4n.github.io/2024/01/29/%E9%85%8D%E6%96%B9%E6%90%9C%E9%9B%86%E2%80%94%E2%80%94%E7%BA%B8%E6%9D%AF%E8%9B%8B%E7%B3%95/","excerpt":"","text":"空气炸锅纸杯蛋糕 来源：https://www.bilibili.com/video/BV1zR4y1W72J/ 实际制作时有所改动，原配方也可。按一般空气炸锅大小，大约能放下8个纸杯，制作时一般按下述的二倍量制作。 材料（4-5个纸杯蛋糕左右）： 低筋面粉 100g（中粉高粉可以掺入淀粉降低筋性比例） 泡打粉 4g 玉米油&#x2F;黄油 70g（可减，不低于50g） 白糖 100g（偏甜口，可减） 牛奶 70g（油少就多加对应克重的牛奶） 鸡蛋 1个 可可粉 25g（看个人喜好，也可以多加） 辅料：坚果碎、巧克力豆等（看个人喜好） 流程： 辅料以外的材料全部搅匀至没有明显颗粒 洒上辅料 空气炸锅160度20分钟，最后3-5分钟可以180度增加表面酥脆感","categories":[],"tags":[{"name":"烹饪","slug":"烹饪","permalink":"https://g4ng4n.github.io/tags/%E7%83%B9%E9%A5%AA/"}]},{"title":"【废案】《战锤任务:卡牌版》规则翻译","slug":"【废案】《战锤任务-卡牌版》规则翻译","date":"2024-01-26T03:52:57.000Z","updated":"2024-08-13T12:58:25.530Z","comments":true,"path":"2024/01/26/【废案】《战锤任务-卡牌版》规则翻译/","permalink":"https://g4ng4n.github.io/2024/01/26/%E3%80%90%E5%BA%9F%E6%A1%88%E3%80%91%E3%80%8A%E6%88%98%E9%94%A4%E4%BB%BB%E5%8A%A1-%E5%8D%A1%E7%89%8C%E7%89%88%E3%80%8B%E8%A7%84%E5%88%99%E7%BF%BB%E8%AF%91/","excerpt":"","text":"本文不包含全部文本内容翻译，仅翻译重要部分，以便游戏正常进行。顺道吐槽一下FFG的一贯作风，把规则书拆成两本，文章结构一塌糊涂，每次看到都要高血压。 重要的写到最前面 太长不看版规则介绍，不包括一些细节。 1-4合作游戏，solo的话1控2，开始前选英雄，拿英雄对应的动作牌（要选最基础的那几张，战役中要慢慢升级）。 每个英雄面前有一个交战区，所有玩家共享一个阴影区，这几个区域用来区分敌人与谁交战，游戏里英雄和敌人互相伤害，伤害大于血量立刻判定为被打败。打败的敌人弃掉、打败的英雄不再参与当前任务，下个任务复活。 游戏里有地牢牌（代表随机遭遇）、敌人牌（打怪）、天谴牌（boss怪）、装备牌（开宝箱之后抽这个）、地点牌（带有特殊效果的地点，代表着游戏进度，地点自身也有个进度，被填满后就进入下一个地点）、英雄牌（各种技能啥的） set是按任务卡描述来，将各种牌库洗混放好。注意随机混入牌时要先挑出罗马数字和任务牌一致的牌来，表示着内容强度所以要一致。任务卡要求加入特定怪物时，要将同名怪物卡一并加入（2黑1红一共三张牌）。 游戏有个险情进度条，越推进坏事越坏，推进要执行对应效果，推到最后不会游戏结束，但最后一格效果会重复触发。 游戏进行就是所有英雄行动、所有怪物行动、地点、险情四个步骤。 英雄行动就是横置自己的动作牌然后按动作牌牌面描述扔对应数量白骰子，同时根据与自己交战敌人数量扔黑骰子，然后结算效果。如果英雄将要横置带有回收标记的动作，那么他立刻再将所有动作牌重置。回收标记的牌不会被横置。 白骰子的双锤表示成功，用来触发行动的效果 白骰子的盾牌表示抵消黑骰子的伤害 白骰子的太阳表示暴击（大成功），先拿个成功token记录这次成功，然后再重扔这个暴击骰子 黑骰子的爪子表示触发交战区敌人的攻击，一个爪子对应触发一名敌人，如果多名敌人多于爪子数，按攻击力从高到低顺序排列。如果爪子多于敌人数，敌人攻击不会重复。横置的敌人不能攻击。 黑骰子的头骨表示触发天谴效果，按boss卡牌面内容结算，天谴不会在一次行动中重复多次。 攻击就是选交战区敌人然后利用成功标记造伤 协助动作会让玩家把成功token（攒起来的成功效果）交给其他英雄保存，必须保存到对应动作上，一个动作最多存2个成功token 探索就是往地点牌放进度token，推进游戏进度 休息就是恢复资源 英雄轮流行动一次然后英雄阶段结束。 敌人行动就是由英雄轮流激活自己交战区、阴影区的非横置敌人，每次每个英雄激活一只怪，轮流来直到能被激活的怪都被激活了。 激活敌人时按牌面左到右顺序结算关键字效果 地点阶段结算地点牌的效果，如果地点牌进度满了，就翻新的地点牌。 险情阶段推进一格险情，如果推到了一个红&#x2F;绿&#x2F;蓝色的格子，执行对应效果。 任务不论成功失败都会继续推进（有对应的奖励与惩罚），五个任务构成了游戏的整个战役。还有个探索任务，可以实现类似迷你战役，或者说重复刷的效果，实际上就是无尽模式，没什么新活。 Learn to Play部分概述《战锤任务：冒险卡牌游戏》是一款合作卡牌游戏，在游戏中，1-4名玩家控制一个英雄小队合作完成一系列战锤宇宙中的任务，以对抗邪恶与混沌。 配件介绍1本规则参考（傻逼ffg） 6张双面任务卡 6个骰子（3个英雄骰子、3个敌人骰子） 1个队长token 1个险情token 20个成功token 9个双面进度token 45个双面伤害token 12张英雄牌（4个英雄*每个英雄3张） 32张行动牌（4个英雄*每个英雄8张） 50张敌人牌 26张地点牌 12张传奇装备牌 33张装备牌 12张状态牌（3种状态类型*每种4张） 38张地牢牌 教学关玩家按下述指示，逐步设置教学关卡。在教学完成后，玩家可以后续的进阶规则，之后玩家们就可以正常进行战役了。 选择英雄：每名玩家从4名英雄中选择一个自己喜欢的。接着，玩家拿取自己英雄对应的英雄卡，只拿取右下角数字最小的4张牌，这4张牌成为英雄的4个基础行动牌（牌底部内容可区分）。如果是一名玩家进行游戏，则他额外选取一名英雄，控制2名英雄进行游戏。 放置地点牌：将Throng of Webs地点牌正面向上放置在所有玩家都看得见的地方，这张牌是教程中玩家们将要探索的地点。 设置地牢牌组：移除两张Locked Gold Chest、Warpstone、Cannon，将它们返回到游戏盒中，教程中不会使用到这几张牌。然后混洗剩余的地牢牌组成地牢牌组，将它背面向上放置在所有玩家都够得到的地方。 放置敌人：找出两张灰色敌人牌Rat Swarm、两张灰色Night Goblin Archer、两张Giant Wolf。将这几张牌洗混，然后为每一名英雄随机抽取一张，正面向上放置在英雄牌前，再随机抽取两张背面向上放置在玩家们够得到的地方。将剩余敌人牌返回游戏盒中。 放置指示物供应堆：将伤害标记、成功标记、进度标记分别堆在一起，放置在玩家们够得到的地方。 确定队长：选取一名玩家成为小队队长，该玩家拿取队长标记并在游戏开始时第一个行动。 游戏内容游戏以若干个游戏轮进行，在每个游戏轮中：1. 激活每个英雄、2. 激活每个敌人、3. 结算地点效果。 激活英雄：在游戏轮的开始，由队长开始，沿顺时针依次行动，每个英雄通过一个回合来激活，当英雄激活时，他进行一次行动。 进行行动。每名英雄有四种行动牌：探索、休息、协助、攻击。如果要进行行动，英雄在就绪的行动牌中选择一张消耗（以横置表示）。每名英雄都有一张右下角标有重整图标的行动牌，当英雄消耗一张有此图标的行动牌后，他将所有已经消耗的行动牌恢复到就绪状态，这些恢复的牌在下轮即可使用。有些游戏效果要求英雄强制消耗一张行动牌，这些效果不会消耗标有重整图标的牌。选取了行动牌后，英雄结算牌面效果，从上到下结算。每张行动牌的主要效果被称作行动，在牌面上以加粗大写字母标识出。结算效果时，英雄获取然后投掷骰子。 获取骰子：根据行动牌的表述，拿取对应数量的白色骰子，然后为每个与英雄交战的、准备就绪的敌人拿取一个黑色骰子。游戏中的敌人牌要么是与英雄交战中，要么是潜伏在中。位于英雄游戏区域的敌人是与英雄交战的敌人，位于中央游戏区、不与任何英雄交战的敌人是潜伏状态的敌人。在教程的初始设置中，每名英雄与一名敌人交战、两名敌人背面向上处于潜伏状态。 投掷：获取骰子后，英雄投掷这些骰子然后结算图标： 成功（双锤）：对于每个成功，玩家从供应堆拿取一个成功token。成功对于每一个结算的行动来说都有独特的效果。 暴击（太阳）：对于每个暴击，玩家拿取一个成功token并且重新投掷暴击骰子。 防御（盾牌）：对于每个防御，玩家减少他将要受到的1点伤害。 攻击（爪印）：对于每个攻击，每个准备就绪的、与当前英雄交战的敌人进行一次攻击 天谴（头骨）：教程中忽略天谴标记效果。 敌人攻击：每个敌人每次行动只能攻击一次。如果与当前英雄交战的敌人数量大于投出的攻击数量，那么并非所有敌人都会参与到本次攻击中。攻击力更高的敌人优先作为攻击者参与攻击。结算攻击时，英雄将所有进行攻击的敌人牌上的（左下角蓝色菱形标记数字）攻击值加总，然后受到这些伤害，拿取对应数量的伤害标记，每一个防御减少一点伤害。 使用成功标记：对于每一种行动，成功标记产生不同的效果。 探索：每个成功在地点牌上放置对应数量的进度标记。 休息：每个成功移除一个伤害标记。 协助：将每个成功分配给另一名英雄的行动卡，将成功标记放置在他的行动卡上，每张行动卡最多存储2个成功标记。在那名英雄行动时，他可以使用行动牌上存储的成功标记。 攻击：攻击前先确定攻击的目标，从交战敌人中选取，每个成功给敌人放置一个伤害标记。如果攻击行动具有远程攻击的表述，英雄可以标记任何敌人，包括没有和他交战的敌人，例如其他玩家交战的敌人或潜伏状态的敌人。有的攻击允许玩家标记多名敌人，在这种情况下，玩家自由分配伤害标记（注意并不是每名敌人都受到这些伤害，而是玩家选择分配）。 面朝下的敌人：面朝下的敌人在结算时和面朝上的敌人一样进行结算，只是其牌面信息被隐藏起来。面朝下的敌人会因为一些原因被翻开成为面朝上： 该敌人受伤 该敌人进入交战状态 该敌人将要激活 面朝上的敌人不会再被返回至面朝下状态。 激活敌人：所有英雄都激活后，开始激活敌人。从队长开始，每名英雄激活一名准备就绪的敌人。英雄们重复激活敌人直到所有敌人都消耗。 选择一名敌人：如果可能，玩家必须选取一名交战中的、就绪的敌人。如果玩家没有和任何敌人交战，或所有与其交战的敌人都处于消耗状态，则该玩家从潜伏敌人中激活一个就绪的敌人。如果上述条件都不满足，则玩家跳过激活敌人阶段。 结算敌人效果：每张敌人牌的底部都有关键字，当敌人被激活时，玩家从左到右结算这些关键字，大部分敌人牌拥有下面三种基本关键字 前进：该敌人与激活它的英雄交战。如果该敌人已经与这名英雄交战，忽略本关键字。 撤退：该敌人面朝上返回到阴影区。如果敌人已经在阴影区，忽略本关键字。 遭遇：该敌人对与其交战的英雄造成等同于攻击力的伤害，如果该敌人位于阴影区，则改为对激活它的英雄造成伤害。 有的敌人拥有独特的关键字，这些关键字会在敌人牌上被解释。结算敌人的效果栏后，敌人进入消耗状态。所有敌人都进入消耗状态后，将所有敌人重置进入就绪状态。 地点效果：完成激活英雄和激活敌人后，队伍开始结算地点效果。每张地点牌都在牌面上声明了独特的地点效果。教程中的Throng of Webs地点牌要求队长消耗一张不包含重整图标的行动牌。如果队长已经消耗了所有没有重整图标的牌，忽略该效果。 每张地点牌的右下角都有一个探索值，在本教学中，当地点牌上的进度指示物等于地点牌的探索值，并且所有敌人都被击败时，队伍获得教学关卡的胜利。 游戏轮结束：在每个游戏轮结束时，队长将队长标记交给他左手边玩家，左手边玩家英雄成为下一轮的队长。 额外基础规则本节提供了教学关涉及到的其他基础规则内容。 地牢牌：在探索后，英雄抽取并结算一张地牢牌，地牢牌有两种类型，道具和事件 道具：道具是英雄在探索地点时找到的物品，大多数物品为英雄提供一次性增益效果，当英雄抽到道具牌时，他将其摆放到自己面前的游戏区中，按照牌面内容选择时机打出。 事件：事件有好有坏，当英雄抽到一张事件牌时，他必须立刻念出牌面内容并依照牌面内容进行结算。然后英雄将这张牌放入地牢牌弃牌区。注意：有的地牢牌左下角会出现宝藏图标，在教学关中忽视这些图标。 状态牌：一共有三种状态，每一种都在英雄身上施加一个持续的效果。当英雄收到一种状态时，他将相关联的状态牌放置在自己的游戏区域内。每种状态牌描述了状态的作用和移除的条件。英雄不能同时拥有多张同类状态牌。 强化 流血 恶心 成功标记：当英雄获取到成功标记时，例如通过协助动作收到成功标记，他需要将其放置在动作牌上（每张动作牌最多容纳2个成功标记）。在英雄掷骰子前，他可以从他要执行的动作牌上选择并花费一个成功标记。每一个以此法花费的成功标记被视为一个成功，花费掉的成功标记返回到供应堆中。 伤害 受到伤害：每次英雄或敌人受到伤害，拿取等值的伤害标记到英雄&#x2F;敌人牌上。每名英雄或敌人都在牌上标有一个生命值，当伤害标记大于等于这个值时，英雄或敌人被击败。 伤害恢复：每次英雄或敌人恢复伤害，移除等量的伤害标记，将其返回到供应堆中。 击败：当一名英雄被击败时，教程立刻终止。在一张正常游戏中，一名被击败的英雄会在任务中被移除，在结算阶段重新回到游戏。当一名敌人被击败，立刻将敌人牌弃掉，将其上的伤害标记返回到供应堆中。 进阶规则在通过教学关卡后，玩家们已经对英雄和敌人的动作结算有了基础理解，本节将为玩家介绍进阶规则，以供玩家完成一次完整的战役任务。 任务：本游戏包含了五个需要玩家按顺序完成的任务，这5个任务组成了战役An Uneasy Alliance，同时游戏还提供了一个Lost in the Dark探索任务。 任务卡：每个任务都有一张对应的任务卡，这些任务为英雄们提供了游玩和设置任务的必要规则，每张任务卡都是双面的。一面包含了初始设置信息、剧情文本以及完成任务或任务失败后的结果（奖励与惩罚）。游戏团队在任务开始前和任务结束后参考这一面的信息。任务卡的另一面包含了任务规则、胜利或失败条件、险情轨、险情效果（参考险情规则介绍部分）。游戏团队在游戏过程中需要使用这一面。 任务规则：每个任务都在险情轨上方标注了任务规则，任务开始前阅读这部分内容是非常必要的。 生成敌人：大多数游戏效果要求队伍生成敌人，敌人总是一次生成一个。具体做法为：英雄从敌人牌库中抽取一张敌人牌然后将其正面朝上放入自己的游戏区，这意味着英雄会立刻与其进入交战状态。 游戏流程：如前所述，本游戏以一系列的游戏轮展开，每个游戏轮包含四个阶段，这四个阶段依次执行 英雄阶段：每名英雄按教学关部分所述轮流行动。 敌人阶段：每名敌人按教学关部分所述轮流行动。 地点阶段：队伍可以行进到一个新的地点，然后必须结算任何可以生效的地点效果。 险情阶段：队伍推进险情等级，然后阶段任何可以生效的险情效果。 地点阶段：在本阶段，队伍必须结算任何可以生效的地点效果，然后队伍继续进行险情阶段。 地点效果：每个地点都有地点效果，在地点阶段，队伍阅读地点效果并结算，并非所有地点效果都需要在每一个游戏轮被结算。 行进：当地点牌上的进度等于地点的探索值，地点就被完全探索了，在地点阶段，如果一个地点被完全探索，队伍可以选择并行进至一个新的地点。当队伍行进时，前一张地点卡被弃掉，其上所有进度指示物被返回至供应堆。此外，在阴影区的所有非天谴级别敌人卡也被弃掉。然后，队长从地点牌堆抽一张新地点牌，将其正面向上放置在游戏区内，并生成敌人。 生成：当行进揭示一张新地点卡后，队伍必须依照牌面上的生成值来生成敌人，每一张地点牌拥有两个生成值，红色头骨背景的数字表明依照正常生成规则生成的敌人数量，黑色头骨背景的数字表明生成至阴影区的敌人数量。 险情阶段：在险情阶段中，队伍将险情标记向右推进一格。当增加了险情等级后，队伍结算任何与当前险情标记所在的险情格颜色匹配的效果，如果险情标记没有处于绿&#x2F;红&#x2F;蓝色险情格，则无事发生。如果险情轨已经推进到最后一格，则后续每次可能的推进都会让险情标记留在原地，但效果被重复执行。 交战限制：一名英雄不能同时与超过三名敌人交战，如果英雄已经与三名敌人交战，此时有效果强制英雄与一名新的敌人进行交战，那么英雄会遭受那名敌人的攻击值的伤害，然后敌人正面向上放入阴影区。 复原：有的敌人牌拥有一个复原值（在生命值旁以小号数字标出），每当拥有复原值的敌人受到攻击动作的伤害，该敌人减少受到的伤害，减少的值等于该敌人的复原值。任何直接对敌人造成伤害的效果忽视复原值。 层级：敌人牌、地点牌、人物卡都有着一个以罗马数字标出的层级数值，该数值用于标注敌人&#x2F;地点对应的任务。 天谴：每个任务包含一个天谴，天谴是一名独特且强大的敌人。每名天谴由左上角的任务图标进行区分，天谴敌人不会洗入敌人牌库。 天谴设置：每张任务卡的“敌人”节会声明如何设置天谴牌。 天谴藏身处：有的任务卡会指示队伍将天谴放置在天谴藏身处，这是一处靠着任务卡的游戏区域（除了正常游戏区、交战、阴影之外的一个特定区域），在该处的天谴不能被指定为任何目标，除非满足任务卡指出的可以这样做的时机。 天谴效果：每名天谴都在牌的底部声明了拥有的效果，在行动掷骰子时，当其他骰面内容都被结算后，队伍必须结算骰子的天谴面（带兽盔头骨标记）这些效果当天谴与英雄交战、位于阴影区、或位于藏身处时生效。天谴在一次行动中只结算一次，不论一次投出了多少个天谴标记。 牌库设置：每个任务包含了1个敌人牌库、1个地点牌库、1个地牢牌库和1个装备牌库。队伍要在设置阶段将这些牌库创建完成，每张任务卡的背面声明了如何创建这些牌库。牌库中的卡会和一些特定的牌在一起洗混。当加入随机卡牌时，队伍不能获知是哪些牌被加入。 任务图标：类似于天谴，有的地点、地牢、装备牌在左上角具有任务图标，这些牌在没有任务声明时不会被洗入对应牌堆。 敌人牌库：创建敌人牌库时，任务卡会指示队伍将一些特定的敌人组合以及其他敌人加入，当特定敌人被声明加入时，找出完整的一套该敌人牌（一套敌人牌包括同名的三张牌：两张基础敌人牌和一张精英敌人牌）。例如，如果任务卡声明了要将Giant Bats加入敌人牌库，那么实际有三张敌人牌被置入牌库。对于一般敌人，队伍随机抽出特定数字的敌人牌加入牌库，这些敌人牌的层级要和任务卡的层级保持一致。 地点牌库：任务卡会指示包含多少数量的地点牌。当任务卡要求添加一定数量的一般地点时，队伍随机抽出特定数量的地点牌加入牌库，这些地点牌的层级要和任务卡的层级保持一致。 地牢牌库：类似地点牌库说明。 装备牌库：队伍按任务卡指示拿出","categories":[],"tags":[{"name":"桌游","slug":"桌游","permalink":"https://g4ng4n.github.io/tags/%E6%A1%8C%E6%B8%B8/"},{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"}]},{"title":"浅聊桌游规则讲解","slug":"浅聊桌游规则讲解","date":"2024-01-10T10:57:41.000Z","updated":"2024-08-13T12:58:15.082Z","comments":true,"path":"2024/01/10/浅聊桌游规则讲解/","permalink":"https://g4ng4n.github.io/2024/01/10/%E6%B5%85%E8%81%8A%E6%A1%8C%E6%B8%B8%E8%A7%84%E5%88%99%E8%AE%B2%E8%A7%A3/","excerpt":"","text":"前言好久不玩桌游了，最近由于缺乏好的电子游戏而又把目光转向桌游。笔者打算过年前买入一款足够耐玩的桌游，在过年期间召集朋友好好玩几场。因为笔者倾向于游玩高重度的桌游，结合朋友对桌游的爱好程度不同，笔者决定购买一款中到重度之间的桌游（bgg重度3-4左右），而根据笔者对朋友的了解，桌游的教学势必要由笔者亲自进行，提前发布规则书电子档是不会有人看的:|。由此诞生了想要聊一聊桌游规则教学方法的念头。 笔者虽然玩过的桌游不足百款，但规则讲解却有着丰富的实践经验，原因无他，每次约战迟到的一个个朋友都需要笔者重复讲解规则，而笔者在大学期间担任了两年多的技术社团的主要负责职务，在讲解计算机技术上也有一定的经验，因此笔者决定根据自身经验整理出一套合适的桌游规则教学方案。 教学的几个原则笔者将会提出若干个桌游规则讲解原则，原则的说明将会尽量适合绝大多数的桌游规则讲解。由于本文是一种主观的经验的介绍，且是通过笔者在朋友身上的教学经验总结得出，因此读者或多或少难免出现异议，笔者认可这类异议并欢迎讨论。 上面提到的所有的原则都是基于以下几个观点出发： 自己学会某个技能的最好办法就是尝试教会别人。 实践出真知。 类比是最好的理解方式之一。 对于上述出发点，笔者不打算过多说明，笔者认为这些出发点是较为客观、浅显但有效的，因此无需加以解释。 那么进入到原则的说明当中，这些原则不会按照所谓重要程度进行排列，想到哪里就写到哪里。笔者想要提出的原则在下面会按大概的讲解流程书写。在进入正文之前，笔者还是要补充说明，这篇文章不打算涉及毛线类桌游，因为规则过于简单，完全不需要追求讲解的效率与分析对方理解程度，大不了多讲几遍，毛线类的教学很难超过五分钟，因此不需要提前考虑教学问题，当然，如果能应用下列原则也不会犯什么错误就是。 坚持背景代入 对于绝大多数中大盒桌游，无论德式美式，都会有着一个或多或少的背景设定，讲解者最容易忽视这一部分的讲解，一般都是照着规则书大致朗读一遍背景，或是干脆两句话带过，这常常带来不易察觉的后续的讲解困难。笔者认为，背景本身是什么故事并不重要（对于规则教学而言不重要），但仍然要提出背景的原因在于方便玩家的后续理解。这就好像格斗类游戏的出招设定一样，绝大多数的出招按键都是和角色发招的动作相匹配的，这样一来，交代清楚的背景非常有助于加深初学者的记忆。 同样，背景的代入对于游戏配件、游戏目标这些概括性的内容理解非常重要。在TTA教学中，坚持将白点称呼为内政点，所导致的听者理解程度是不同的。背景有助于帮助听者建立规则上的逻辑，从某种程度上说，背景代入到教学中是让玩家从设计师角度解读桌游的规则设计。 而要做好这一点也非常地简单，只需要讲解者记住规则中的名词，坚持使用背景中的词汇，而非“token”、“费用”等词汇。即使游玩时玩家们大多使用这些统一的指代词，教学时也尽量保持着背景氛围的营造。 不要跳过目标&#x2F;对局的结束条件 “目标”是笔者会在背景代入后紧接着讲解的内容，这部分实际上可以算作背景代入的一部分。单独记录出的原因是笔者在视频网站上见到过跳过游戏目标讲解，直接进入流程讲解的视频，这是笔者有意见的地方。游戏的目标作为背景的补充，其被提出时可以帮助玩家快速联想到实现目标所需的途径，进而对玩家理解游戏流程起到一个促进的作用，简单地说，目标的提出能够提升玩家学习流程的积极性，因此从这一关系出发，笔者认为目标的讲解是要在流程之前完成。 永远通过实战讲解流程 每一个讲解过桌游规则的玩家都清楚，流程的讲解才是重中之重，对于流程复杂的游戏来说，听者漫不经心的表现是对讲解者热情的严重打击，有时甚至讲解者会在讲解过程中开始丧失动力，甚至有的时候讲解到一半就想掀桌了，因此流程的讲解可以说非常重要。笔者认为，想要完成一次能够称得上好的流程的讲解，要做到以下几点： 保持听众的疑问：在解决一个问题的解释后，紧接着提出另外的疑问，使得听众保持在求知的状态中，能够提升讲解的效率，以及保证听者的精神集中。 必须熟悉流程框架：讲解者在讲解开始前，可以不必理解游戏的每一条细则，但对于流程的大致框架则必须做到熟练，规则的讲解必须在第一时间给听者留下一个正确的印象，否则一旦讲解者意识到大的流程错误，再想改正，听者的积极性就会大打折扣，甚至没准会开始刷手机，留下讲解者一个人翻阅规则书。 边set边讲：讲解者应当尽量从set开始讲起，逐一为听者介绍游戏组件，在此期间，讲解者要有意引导听者上手进行set，可以是以要求听者帮忙拿取配件的方式展开，这样的过程能够加深听者对游戏内容的印象，也能提高一些set的速度，同时还避免了set过程中，讲解者忙着set导致的冷场。 合理暂停：很多时候，讲解者会不自觉地加快讲解速度，毕竟有着想要马上开始对局的强烈愿望，语速的加快是正常的，甚至难以避免的。因此笔者认为讲解者应当适当地暂停讲解，提供一些时间供听者消化规则。暂停的场合一般设置在单条复杂规则的讲解结束后，或对游戏卡牌、版图等涵盖丰富信息的内容讲解期间。举例来说，对于像是TTA这样的复杂游戏，一般讲解了玩家版图后讲解应当适度暂停，确定听者理解版图描述后继续进行。或是在灵迹岛的敬畏规则讲解后暂停，供听者消化敬畏的产生、循环、敬畏卡等内容，将其串连起来后进行。需要说明的是，暂停期间不代表讲解者不说话留白，而是应当进行一些简单的规则处理测验（也就是随堂小测），随机向听者提问刚刚讲述的内容的实例，鼓励听者指出规则实例的处理流程并进行评判。说白了，就是把规则书上一般会有的示例提供给听者进行演算。 分轻重缓急：对于游戏的细节内容，笔者认为不需要在规则讲解时介绍，只需要向听者说明此处规则被跳过即可。细节内容一般指部分特殊情况的处理、词条词缀关键词等规则，另一个跳过这类规则的理由是，讲解者自己甚至都有可能搞错，既然没把握让听者记住，那就干脆跳过这里，等到教学对局开始后再进行吧。例如立直麻将中的符点计算，甚至有天凤十段的选手都难以招架符点那一条条独立的细则，因此干脆就不要讲解好了，用到时再翻阅，或是留到有一定游戏经验后再讲解。 必须要有的教学关：名为教学关，实则是推新局，在这样的对局中，讲解者应当尽量确保新人的游戏体验——该放水时就放水。但也不必故意跳过某些行动，相反应当多做出一些正常游玩时的策略行动，以向新人展示桌游的真正打法。笔者认为，对于高重度的桌游讲解，重度越高越应当照顾到对方的游戏体验，毕竟能跟你打重策的朋友屈指可数，游戏体验的缺失很容易就导致玩家的流失，最后的结局就是大盒放在家中吃灰。那么如何科学合理地放水呢？笔者认为放水的最有效、也是最不那么明显的方式就是学习新人的操作，新人干什么讲解者就干什么，而在一次次的模仿当中，讲解者穿插着加入一些经验、套路、能够明显提高自身优势的操作，让新人潜移默化地学习到游戏的一些内容。 不要直接搬出套路公式：套路化的操作固然重要，但不宜在新人对局次数不多时提出，可以适当通过教学关的放水方式提出。直接讲解的套路公式会让新人缺少一款桌游开荒时的探索乐趣，而这种乐趣在套路化实现后就难以获得。 因人而异的教学相信读者都能认同，桌游规则的教学如同世界上一切教学，都是需要因人而异的。对于不同性格的新人玩家，采取不同的教学节奏能够有效提升教学的效率。这里的效率指的是听众真实掌握的内容所占讲解者讲解的内容的比例。笔者将尝试采用身边的案例，结合当前较为流行的MBTI性格分类法简单讲一下教学节奏的处理。注意笔者并非心理学研究爱好者，也并非教育学的学者，亦非桌游界的熟练讲师，本章内容的实践要多结合读者自身能力与对听众性格的判断来实现，使用MBTI分类也只是因为该方法较为流行，不代表笔者认可其科学性，如果本文写于十五年前，笔者大概会按照星座分类进行讲解。 这部分内容会按照MBTI的四组偏好进行分类讨论，而如何确定听众属于何种分类则不是本篇文章所能合理解释的内容，建议读者结合社会交流经验判断。因为笔者的桌游讲解经验无一例外都是在好友身上进行的实践，所以笔者也无法给出客观的桌游玩家分类经验。 内向与外向（E与I）：在规则讲解当中，内向的玩家倾向于主动消化吸收规则解释，而外向玩家更倾向于多次向讲解者提问的方式来掌握规则，因而讲解者面对内向的玩家时，可以多向他们提问规则内容，即使他们没有掌握内容也很少直接表现出来，因此提升互动次数是帮助I型玩家理解规则的好办法。对于E型玩家，讲解者可以减少纯讲解的内容，采用多举例的方式来帮助消化规则。 实感与直觉（S与N）：对于S型玩家，强烈建议讲解者多多举例，最好是直接使用配件摆放出来示例场景；对于N型玩家，讲解者应当尽量从大的框架角度，甚至从规则设计角度出发讲解规则。 思考与情感（T与F）：对于T型玩家，在教学中适当多加入对规则框架的补充（适当讲一些游戏的Q&amp;A内容，一些细则的介绍可能反而有助于这些玩家理解规则框架）；对于F型玩家，如果可能则尽快进入到教学关环节，在教学实战中完成大多数的讲解内容。 判断与感知（J与P）：对于J型玩家，给他们多一点思考时间，在教学关中尽量尊重他们的独立决定，只要不违背规则，就不指出操作的问题；对于P型玩家，可以让他们在教学关中成为你的下家（后手），他们可能会更多地参考你的行动来做出自己的行动。 上述方法作为经验之谈，难以给出特别实际的指示。在桌游教学中，听众的性格往往难以统一归类，因此上述讨论在实践面前就显得异常单薄，如果强行按上述讨论内容进行处理，难免出现适得其反的效果，什么都要的结果可能是什么都得不到。 桌游讲解的实践上文当中，笔者所提出来的种种要点只不过是把大家基本都认可的东西拿出来写一写，难以给有经验的讲解者带来什么新的观点，又似乎不足以使缺乏讲解经验的讲解者读得通透。所以下面笔者将会以立直麻将的教学为例，遵循上述要点，简单梳理出一个流程供翻阅，希望能够帮助到有需要的讲解者。 讲解之前的准备，自然是讲解者要充分了解规则，而对于规则复杂的游戏来说，例如大盒游戏，讲解者也很难完全熟知其中种种细节，选用立直麻将作为讲解案例也是考虑到这一点。相信桌游玩家们大都接触过麻将，其中又有相当一部分玩家接触过立直麻将。熟悉立直麻将的玩家应该会清楚，尽管日麻规则的上手并不难，但日麻的役种、点数计算却是需要相当的对局经验才能慢慢掌握的，即便是日麻的忠实玩家，也不一定能够一下子列出日麻规则中的役种、符点。笔者会将日麻规则中这部分需要经验积累、难以在初学阶段学习的规则列为“轻重缓急”当中讲解顺序最靠后的那一类，大部分此类规则可以说毫无记忆的必要，多数情况只需要使用日麻的点数计算工具或查阅表格或是干脆简化分数计算方式来实现。如果是网麻，那么所必须记忆的内容就更少了。 背景介绍：日麻没有什么背景可以介绍，因此这部分可以跳过，由于其流行性，若是时间充足讲解者可以提前引导玩家去看一些日麻动漫之类的作品，或是讲一下麻将的起源与发展。 目标介绍：那么实际要做的就是一上来介绍麻将的目标，麻将的主要目标即是“和（胡）牌”，和牌的同时又要兼顾点数，在提高和牌收入点数的同时保证和牌概率不会太低，总的来说是一种动态规划问题，如何权衡和牌与和牌大小是区分菜鸟与高手的重要判据之一。 由上述目标，自然可以引出“什么是和牌”这一疑问，带着这样的疑问，讲解者此时就可以代入游戏的流程“抓牌、切牌”，重复这样的流程，在这样的基本流程当中存在着吃、碰、杠、立直的选项，这些选项能够使玩家逐渐将手上的牌凑出和牌的牌型，进而取得对局的胜利。按上述流程的说明，大致的框架就交代清楚了。注意上述内容中不要针对吃碰这样的内容进行详细展开，可以不讲，也可以简单几句带过，否则听众无法树立起日麻的规则框架，后续的规则理解会支离破碎。 大致框架讲解完毕后，讲解者应当带领听众进入游戏set过程，在set过程中逐一解释日麻茫茫多的术语词汇的一部分，如牌山、王牌、岭上、副露、牌河、dora、自风、场风等，依然是不要过度展开。其实这些词汇中有很多就是一个特定称呼，只要引导听者尽量记住即可，码牌过程中可以多次提问并要求听者作答以加深印象，甚至可以要求听者为讲解者重复讲解一遍。 之后就进入到对局，第一局大家可以以公开手中的牌的形式进行。对局正式开始前，讲解者先通过实际举例的方式讲解和牌的基本判断，由此衍生出役种的介绍，注意尽量只介绍常见一番、二番役即可，也可以加入一些夸张的役种介绍，如九莲宝灯、国士无双等满贯役种，可以配合一些夸张的讲解活跃一下气氛。这之后就是摸牌切牌的循环，讲解者时不时地讲解自己为什么这么打、这么打了之后会有什么变化，进而代入其他的内容，如门前清、吃碰、顺刻、明暗刻&#x2F;杠等，以及振听这样的初学者最常犯的错误、断幺九、立直等最常见的和牌役种。整个对局中，讲解者应当观察听者的反应，如经常在切牌时迟疑，可以主动为其重复和牌役种、和牌的牌型等内容要点。如果听者有些泄气（产生一些厌烦心理），则可以主动提问听者，使其注意力回到教学当中。讲解者应当避免使用命令式的语气，亦要避免自己陷入消极状态——既然决定要讲解，那就努力做到最好，不要让听众影响你的情绪，不要在新人犹豫不知切什么牌的时候催促、命令，要时刻观察对方的状态，如果是在积极思考，可以说一些鼓励的话；如果是不知所措，那么就如上所述，使用提问将新人的思绪拉回到麻将上。 当可以比较轻松地完成一场明牌的麻将对局流程后，主要的教学工作可以说已经成功结束了。接下来就是进行慢速的、无计分的常规流程麻将，此时讲解者可以拿出准备好的役种提示纸（如果麻将牌没有附带役种提示就自己网上找一找打印出来），尝试代入完整的役种类型进行对局。在此后的对局中，讲解者逐渐加入点数计算（点数计算也可以先一律按符数&#x3D;底符&#x3D;30点规则进行，毕竟讲解者也大概不太会算）、完整半庄战等，可以适当放慢切牌的速度，加入一些防守策略、牌效的介绍，让新人们知道“哦，原来日麻高手是这样理解日麻对战的”，此后的对局会越来越流畅。因为麻将单个对局的运气成分明显，讲解者也可以毫无保留地放开了打，最好是做一些满贯出来，毕竟新人都是怪物，现在不抓住稍纵即逝的机会以后可能就再也遇不到了:)。","categories":[],"tags":[{"name":"桌游","slug":"桌游","permalink":"https://g4ng4n.github.io/tags/%E6%A1%8C%E6%B8%B8/"},{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"}]},{"title":"A Bravo New Blog","slug":"A-Bravo-New-Blog","date":"2023-12-19T15:30:57.000Z","updated":"2024-08-13T12:58:02.171Z","comments":false,"path":"2023/12/19/A-Bravo-New-Blog/","permalink":"https://g4ng4n.github.io/2023/12/19/A-Bravo-New-Blog/","excerpt":"","text":"又要到饭了，兄弟们！","categories":[],"tags":[{"name":"琐碎","slug":"琐碎","permalink":"https://g4ng4n.github.io/tags/%E7%90%90%E7%A2%8E/"}]}],"categories":[],"tags":[{"name":"桌游","slug":"桌游","permalink":"https://g4ng4n.github.io/tags/%E6%A1%8C%E6%B8%B8/"},{"name":"游戏","slug":"游戏","permalink":"https://g4ng4n.github.io/tags/%E6%B8%B8%E6%88%8F/"},{"name":"TRPG","slug":"TRPG","permalink":"https://g4ng4n.github.io/tags/TRPG/"},{"name":"烹饪","slug":"烹饪","permalink":"https://g4ng4n.github.io/tags/%E7%83%B9%E9%A5%AA/"},{"name":"琐碎","slug":"琐碎","permalink":"https://g4ng4n.github.io/tags/%E7%90%90%E7%A2%8E/"}]}